;8255初始化配置

;--------------------------------
;符号定义                         |
;--------------------------------

; 8255芯片端口地址 
L8255PA			EQU		121h		  ;8255端口A地址，输出
L8255PB			EQU 	123h          ;8255端口B地址，输出			
L8255PC			EQU 	125h          ;8255端口C地址，低4位输入，高4位输出	
L8255CS			EQU 	127h          ;8255控制寄存器址	

;--------------------------------
;8255初始化                     |
;--------------------------------

INIT8255 PROC
    MOV DX, L8255CS                   ;8255控制寄存器地址
	MOV AL, 10000001B                 ;控制字，对应方式0，端口A输出，端口B输出，端口C低4位输入，高4位输出	
	OUT DX, AL                        ;写入控制字
	RET
INIT8255 ENDP
