; PC0开关量输出至PC6

;--------------------------------
;符号定义                         |
;--------------------------------

; 8255芯片端口地址 
L8255PA			EQU		121h		  ;8255端口A地址，输出, 低4位用于位选
L8255PB			EQU 	123h          ;8255端口B地址，输出，用于输出段码
L8255PC			EQU 	125h          ;8255端口C地址，低4位输入，高4位输出	
L8255CS			EQU 	127h          ;8255控制寄存器址	

;----------------------------------
;定义代码段                        |
;----------------------------------
    .code                        ;定义代码段
    .startup                     ;定义全局入口点

START:
    CALL INIT8255				 ; 调用过程初始化8255 

Display_Again:
		CALL AccessPC		        ; 调用过程,实现PC0开关量输出至PC6
		JMP  Display_Again			; 循环显示
		HLT							; 停止主程序运行

;----------------------------------
;读取C口数值，并把PC0的值输出到PC6  |
;----------------------------------
AccessPC	PROC
		MOV	DX, L8255PC		; DX指向C端口
		IN  AL, DX			; 读取C口数值
		MOV AH, AL			; 保存C口原输入值
		AND AH, 10111111b	; 清除PC6，此时PC6=0
		AND AL, 00000001b	; 取C口PC0的值
		JZ  APCOut          ; 如果PC0=0,则跳转到APCOut，输出PC6为0
		OR  AH, 01000000b	; 如果PC0=1,才执行此指令，设置PC6为1后再输出
APCOut:
		MOV AL, AH			; 更新AL
		OUT DX, AL			; 输出C口数值
		RET
AccessPC	ENDP
