;T0产生10ms方波

;---------------------------------------
; 符号定义                              |
;---------------------------------------
; 8253芯片端口地址 （Port Address):
L8253T0			EQU		100h		    ;Timer 0
L8253T1			EQU 	102h		    ;Timer 1
L8253T2			EQU 	104h		    ;Timer 2
L8253CS			EQU 	106h		    ;控制寄存器

;---------------------------------------
; 定义代码段                            |
;---------------------------------------
	.code						; 定义代码段
	.startup					; 定义汇编程序执行入口点

    START:						
		CALL INIT8253			 ; 初始化8253
		HLT						 ; 停止主程序运行

;---------------------------------------
; 初始化8253                            |
;---------------------------------------
INIT8253 PROC
	MOV DX,L8253CS               ;DX指向8253控制寄存器
	MOV AX,00110110b             ;T0控制字对应方式3二进制计数,16位
	OUT DX,AX                    ;写入控制字
	
    ;时钟周期1us, 10000个时钟周期为10ms, 10000=2710H

	MOV DX ,L8253T0              ;DX指向T0初值寄存器
	MOV AL,10H                   ;初值低8位
	OUT DX,AL                    ;先写入低8位
	MOV AL,27H                   ;初值高8位
	OUT DX,AL                    ;再写入高8位 

	RET
INIT8253 ENDP